backend/app/controllers/admins_controller.rb

  def destroy
    user = User.find(user_params[:id])
    if user.destroy
---
DELETE FROM "users" WHERE "users"."id" = 6