backend/app/controllers/admins_controller.rb

SELECT "users".* FROM "users"
---
  def user_index
    render json: { users: User.all }

SELECT "users".* FROM "users" WHERE "users"."id" = 13 LIMIT 1
UPDATE "users" SET "name" = 'gabriel', "email" = 'gabriel.silva1125@aluno.ce.gov.br', "cpf" = '400.289.223-20', "number" = NULL, "is_super" = TRUE WHERE "users"."id" = 11
---
  def update
    user = User.find(params[:id])
    if !(user_params[:password])
      if user.update_columns(name: user_params[:name], email: user_params[:email], cpf: user_params[:cpf], number: user_params[:number], is_super: user_params[:is_super])

SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1
---
  def getupdate
    user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."name" = 'devScratch' LIMIT 1
---
  def check_super
    user = User.find_by(name: params[:name])