backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def authenticate_request
    header = request.headers["Authorization"]
    header = header.split(" ").last if header
    begin
      @decoded = JWT.decode(header, 'devScratch', true, { algorithm: "HS256"})
      @current_user = User.find(@decoded[0]["user_id"])