backend/app/controllers/products_controller.rb

  def index
    render json: { products: Product.all }
---
SELECT "products".* FROM "products"

  def create
    if Product.create!(product_params)
---
INSERT INTO "products" ("image", "name", "price", "description", "sizes", "created_at", "updated_at") VALUES ('a', 'Camisa', 10.0, 'Descrição foda', 'G', '2025-06-19 14:03:05.274807', '2025-06-19 14:03:05.274807') RETURNING "id"

  def destroy
    product = Product.find(params[:id])

    if product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = 2 LIMIT 1
DELETE FROM "products" WHERE "products"."id" = 2

  def update
    product = Product.find(params[:id])

    if product.update(product_params)
---
SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
UPDATE "products" SET "name" = 'Camisinha azul', "updated_at" = '2025-06-23 03:13:39.669239' WHERE "products"."id" = 16

  def getupdate
    product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 16 LIMIT 1