backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'gabriel.silva1125@aluno.ce.gov.br' LIMIT 1
---
  def login
    user = User.find_by(email: user_params[:email])