backend/app/controllers/users_controller.rb

  def create
    if User.create!(user_params)
---
INSERT INTO "users" ("name", "password_digest", "email", "cpf", "number", "is_super", "created_at", "updated_at") VALUES ('UserTest', '$2a$12$XM80nsHYJCfV8g4VhExI.enyyVqzsfTHCxmDumeZ0yIsTjBrhbYp2', 'teste@gmail.com', '40028922085', NULL, FALSE, '2025-06-16 17:15:05.089738', '2025-06-16 17:15:05.089738') RETURNING "id"

  def login
    user = User.find_by(name: user_params[:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = 'devScratch' LIMIT 1

  def destroy
    if @current_user.destroy
---
DELETE FROM "users" WHERE "users"."id" = 2

  def update
    if @current_user.update(user_params)
---
UPDATE "users" SET "name" = 'Ismaela', "password_digest" = '$2a$12$3A6m1Qm/ntS/Sofxn0Ofsu7bqL20L/wxht7UZDsHJBcNa46o/04Vm', "updated_at" = '2025-06-18 00:37:56.982685' WHERE "users"."id" = 5